{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "b15fbe23",
   "metadata": {},
   "source": [
    "## Downloading Footbal Domain Data"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5ce1c53b",
   "metadata": {},
   "source": [
    "### Helper websites\n",
    "\n",
    "https://www.w3.org/TR/rdf-sparql-query/#describe <br>\n",
    "https://sparqlwrapper.readthedocs.io/en/latest/main.html#return-formats <br>\n",
    "https://stackoverflow.com/questions/40528578/how-can-i-properly-serialize-wikidata-sparql-queries-answers <br>\n",
    "https://wiki.app.uib.no/info216/index.php/Python_Examples#Retrieving_data_from_Wikidata_with_SparqlWrapper <br>\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "1b66c28b",
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "from rdflib import Graph\n",
    "import datetime\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "4ff7ed30",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "b'<!DOCTYPE html><html lang=\"en\" dir=\"ltr\"><head><meta charset=\"utf-8\"><meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge\"><meta name=\"viewport\" content=\"width=device-width,initial-scale=1,user-scalable=yes\"><link rel=\"stylesheet\" href=\"css/style.min.372a7e7a49dcaedce6ae.css\"><link id=\"favicon\" rel=\"shortcut icon\"><script src=\"js/shim.min.05fe49cdd30866fd4947.js\"></script><style id=\"MJX-CHTML-styles\">/* placeholder for MathJax */</style></head><body><div class=\"wikibase-queryservice container-fluid\"><div class=\"row\"><nav class=\"navbar navbar-default\"><div class=\"navbar-header\"><button type=\"button\" class=\"navbar-toggle collapsed\" data-toggle=\"collapse\" data-target=\"#header-navbar-collapse\" aria-expanded=\"false\"><span class=\"sr-only\">Toggle navigation</span><span class=\"icon-bar\"></span><span class=\"icon-bar\"></span><span class=\"icon-bar\"></span></button><div class=\"navbar-brand\"><a href=\"./\"><img src=\"data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=\"><span></span></a></div></div><div class=\"collapse navbar-collapse in\" id=\"header-navbar-collapse\"><ul class=\"nav navbar-nav navbar-left\" id=\"left-navbar\"><li><button type=\"button\" class=\"btn navbar-btn btn-default\" id=\"open-example\" data-toggle=\"modal\" data-target=\"#QueryExamples\"><span class=\"fa fa-folder-open-o\"></span> <span data-i18n=\"wdqs-app-button-examples\" id=\"examples-label\"></span></button></li><li class=\"dropdown\"><div class=\"btn-group navbar-btn\" id=\"query-builder-dd\"><a target=\"_blank\" href=\"https://query.wikidata.org/querybuilder/\" class=\"btn btn-default dropdown-toggle query-builder-toggle\" id=\"query-builder-toggle\"><span data-i18n=\"wdqs-app-query-builder-name\" id=\"query-builder-label\"></span></a><div class=\"dropdown-menu query-builder\"><strong><p data-i18n=\"wdqs-app-query-builder-dd-title\"></p></strong><p data-i18n=\"wdqs-app-query-builder-dd-copy\"></p><a class=\"query-builder-toggle\" target=\"_blank\" href=\"https://query.wikidata.org/querybuilder/\"><img src=\"./wikibase/queryService/ui/304px_querybuilder_final.gif\"></a></div></div></li><li class=\"dropdown\"><div class=\"btn-group navbar-btn\"><a href=\"https://www.wikidata.org/wiki/Special:MyLanguage/Wikidata:SPARQL_query_service/Wikidata_Query_Help\" target=\"_blank\" class=\"btn btn-default\"><span class=\"glyphicon glyphicon-question-sign\" aria-hidden=\"true\"></span> <span data-i18n=\"wdqs-app-button-help\" id=\"help-label\"></span> </a><button data-toggle=\"dropdown\" class=\"btn btn-default dropdown-toggle\" id=\"help-toggle\"><span class=\"caret\"></span></button><ul class=\"dropdown-menu\"><li><a target=\"_blank\" rel=\"noopener\" href=\"https://www.wikidata.org/wiki/Special:MyLanguage/Wikidata:SPARQL_query_service/Wikidata_Query_Help\" data-i18n=\"wdqs-app-help-portal\"></a></li><li><a target=\"_blank\" rel=\"noopener\" href=\"https://www.mediawiki.org/wiki/Special:MyLanguage/Wikidata_Query_Service/User_Manual\" data-i18n=\"wdqs-app-help-manual\"></a></li><li><a target=\"_blank\" rel=\"noopener\" id=\"examples-link\" href=\"https://www.wikidata.org/wiki/Special:MyLanguage/Wikidata:SPARQL_query_service/queries/examples\" data-i18n=\"wdqs-app-help-examples\"></a></li><li role=\"separator\" class=\"divider\"></li><li><a target=\"_blank\" rel=\"noopener\" href=\"https://www.w3.org/TR/sparql11-query/\">SPARQL</a></li><li><a target=\"_blank\" rel=\"noopener\" href=\"https://www.mediawiki.org/wiki/Special:MyLanguage/Wikibase/Indexing/RDF_Dump_Format\" data-i18n=\"wdqs-app-help-datamodel\"></a></li><li><a target=\"_blank\" rel=\"noopener\" href=\"https://www.mediawiki.org/wiki/Special:MyLanguage/Wikibase/Indexing/RDF_Dump_Format#Full_list_of_prefixes\" data-i18n=\"wdqs-app-help-prefixes\"></a></li><li role=\"separator\" class=\"divider\"></li><li><a target=\"_blank\" rel=\"noopener\" href=\"https://www.wikidata.org/wiki/Special:MyLanguage/Wikidata:Request_a_query\" data-i18n=\"wdqs-app-help-request-query\"></a></li><li><a target=\"_blank\" rel=\"noopener\" href=\"https://www.mediawiki.org/w/index.php?title=Talk:Wikidata_Query_Service&action=edit&section=new\" data-i18n=\"wdqs-app-help-feedback\"></a></li><li><a target=\"_blank\" rel=\"noopener\" id=\"copyright-link\" href=\"https://www.wikidata.org/wiki/Special:MyLanguage/Wikidata:SPARQL_query_service/Copyright\" data-i18n=\"wdqs-app-help-copy\"></a></li></ul></div></li><li class=\"dropdown\"><div class=\"btn-group navbar-btn\"><a href=\"https://www.wikidata.org/wiki/Special:MyLanguage/Wikidata:Tools\" target=\"_blank\" class=\"btn btn-default\"><span class=\"glyphicon glyphicon-cog\" aria-hidden=\"true\"></span> <span data-i18n=\"wdqs-app-button-more-tools\" id=\"tools-label\"></span> </a><button data-toggle=\"dropdown\" class=\"btn btn-default dropdown-toggle\" id=\"tools-toggle\"><span class=\"caret\"></span></button><ul class=\"dropdown-menu\"><li><a target=\"_blank\" rel=\"noopener\" href=\"https://www.wikidata.org/wiki/Special:MyLanguage/Wikidata:Tools/Edit_items\" data-i18n=\"wdqs-app-tools-edit-items\"></a></li><li><a target=\"_blank\" rel=\"noopener\" href=\"https://www.wikidata.org/wiki/Special:MyLanguage/Wikidata:Tools/Query_data\" data-i18n=\"wdqs-app-tools-query-data\"></a></li><li><a target=\"_blank\" rel=\"noopener\" href=\"https://www.wikidata.org/wiki/Special:MyLanguage/Wikidata:Tools/Enhance_user_interface\" data-i18n=\"wdqs-app-tools-enhance-ui\"></a></li><li><a target=\"_blank\" rel=\"noopener\" href=\"https://www.wikidata.org/wiki/Special:MyLanguage/Wikidata:Tools/Visualize_data\" data-i18n=\"wdqs-app-tools-visualize-data\"></a></li><li><a target=\"_blank\" rel=\"noopener\" href=\"https://www.wikidata.org/wiki/Special:MyLanguage/Wikidata:List_of_properties\" data-i18n=\"wdqs-app-tools-list-properties\"></a></li><li><a target=\"_blank\" rel=\"noopener\" href=\"https://www.wikidata.org/wiki/Special:MyLanguage/Wikidata:Tools/Lexicographical_data\" data-i18n=\"wdqs-app-tools-lexicographical-data\"></a></li><li><a target=\"_blank\" rel=\"noopener\" href=\"https://www.wikidata.org/wiki/Special:MyLanguage/Wikidata:Tools/For_programmers\" data-i18n=\"wdqs-app-tools-for-programmers\"></a></li><li role=\"separator\" class=\"divider\"></li><li><a target=\"_blank\" rel=\"noopener\" href=\"https://tools.wmflabs.org/hay/directory/#/search/wikidata\">Wikimedia Toolforge</a></li></ul></div></li></ul><ul class=\"nav navbar-nav navbar-right\" id=\"right-navbar\"><li><a href=\"#\" class=\"uls-trigger\" id=\"language-toggle\" data-toggle=\"tooltip\"></a></li></ul></div></nav><div id=\"query-box\"><form id=\"query-form\" action=\"https://query.wikidata.org/bigdata/namespace/wdq/sparql\"><div class=\"query-main\"><div class=\"toolbar\"><div class=\"toolbar-top\"><div><a href=\"#\" class=\"btn query-helper-trigger\" data-toggle=\"tooltip\" data-placement=\"top\" data-i18n=\"[title]wdqs-app-button-query-helper\"><span class=\"fa fa-info-circle\" aria-hidden=\"true\"></span></a></div><div><a href=\"#\" class=\"btn fullscreen-toggle\" data-toggle=\"tooltip\" data-placement=\"top\" data-i18n=\"[title]wdqs-app-button-fullscreen-title\"><span class=\"fa fa-arrows-alt\" aria-hidden=\"true\"></span></a></div><div class=\"dropdown\"><a href=\"#\" class=\"btn dropdown-toggle\" data-toggle=\"dropdown\" role=\"button\" aria-haspopup=\"true\" aria-expanded=\"false\" data-i18n=\"[title]wdqs-app-button-prefixes\"><span class=\"fa fa-thumb-tack\" aria-hidden=\"true\"></span><span class=\"caret\"></span></a><ul class=\"dropdown-menu\"><li><strong data-i18n=\"wdqs-app-button-prefixes\"></strong></li><li role=\"separator\" class=\"divider\"></li><li><div class=\"namespace-shortcuts\"></div></li><li role=\"separator\" class=\"divider\"></li><li><a class=\"addPrefixes\" data-i18n=\"wdqs-app-editor-addprefixes\"></a></li></ul></div><div><a href=\"#\" class=\"btn\" id=\"format-button\" data-toggle=\"tooltip\" data-placement=\"top\" data-i18n=\"[title]wdqs-app-button-format-title\"><span class=\"fa fa-diamond\" aria-hidden=\"true\"></span></a></div><div><a href=\"#\" class=\"btn\" data-i18n=\"[title]wdqs-app-button-examples\" data-toggle=\"modal\" data-target=\"#QueryExamples\"><span class=\"fa fa-folder-open-o\" aria-hidden=\"true\"></span></a></div><div><a href=\"#\" class=\"btn restore\" id=\"restore-button\" data-toggle=\"tooltip\" data-placement=\"top\" data-i18n=\"[title]wdqs-app-button-restore-title\"><span class=\"fa fa-history\" aria-hidden=\"true\"></span></a></div><div><a href=\"#\" class=\"btn\" id=\"clear-button\" data-toggle=\"tooltip\" data-placement=\"top\" data-i18n=\"[title]wdqs-app-button-clear-title\"><span class=\"fa fa-trash-o\" aria-hidden=\"true\"></span></a></div><div><a href=\"#\" class=\"btn shareQuery shortUrlTrigger query\" target=\"_blank\" data-i18n=\"[title]wdqs-app-shorturl-page-title\" data-toggle=\"popover\"><span class=\"fa fa-link\" aria-hidden=\"true\"></span></a></div></div><div class=\"toolbar-bottom\"><button type=\"submit\" class=\"btn btn-info\" id=\"execute-button\" data-toggle=\"tooltip\" data-placement=\"top\" data-i18n=\"[title]wdqs-app-button-run-title\"><span class=\"fa fa-play\" aria-hidden=\"true\"></span></button></div></div><div class=\"query-helper-and-editor\"><div class=\"query-helper query-helper-hidden\"><div class=\"panel panel-info\"><div class=\"panel-heading\"><strong data-i18n=\"wdqs-app-help-queryhelper\"></strong> <a target=\"_blank\" rel=\"noopener\" id=\"query-helper-help\" href=\"https://www.wikidata.org/wiki/Special:MyLanguage/Wikidata:SPARQL_query_service/Query_Helper\"><span class=\"glyphicon glyphicon-question-sign\"></span></a> <button type=\"button\" class=\"close\" aria-label=\"Close\"><span aria-hidden=\"true\">&times;</span></button></div><div class=\"panel-body\"></div></div></div><div class=\"splitter\"></div><div class=\"query-editor-container\" dir=\"ltr\"><textarea class=\"queryEditor\" name=\"query\" data-i18n=\"[placeholder]wdqs-app-editor-placeholder\" placeholder=\"(Input a SPARQL query or choose a query example)\"></textarea></div></div></div><div class=\"navbar navbar-default query-helper-tag-cloud query-helper-hidden\"></div><div class=\"status navbar navbar-default toolbar\"><div class=\"navbar-right\"><span class=\"dataUpdated\"></span></div></div></form></div></div><noscript><div class=\"row action-bar\" style=\"display: block\"><div class=\"message\"><div class=\"label label-warning\">For interactive query editing, a localized user interface, and other improvements, please enable JavaScript or use a browser that supports it.</div></div></div></noscript><div class=\"row\"><nav class=\"navbar navbar-default result\"><ul class=\"nav navbar-nav navbar-left\"><li><a id=\"display-button\" href=\"#\" data-toggle=\"dropdown\" class=\"dropdown-toggle\" data-placement=\"top\" data-i18n=\"[title]wdqs-app-button-display-title\"><span id=\"display-button-icon\" class=\"glyphicon glyphicon-eye-open\" aria-hidden=\"true\"></span><span id=\"display-button-label\"></span><span class=\"caret\"></span></a><ul id=\"result-browser-menu\" class=\"dropdown-menu\" role=\"menu\"></ul></li><li></li><li><a target=\"_blank\" class=\"help\" rel=\"noopener\" href=\"https://www.wikidata.org/wiki/Special:MyLanguage/Wikidata:SPARQL_query_service/Wikidata_Query_Help/Result_Views\"><span class=\"fa fa-question-circle\"></span></a></li></ul><ul class=\"nav navbar-nav navbar-right\"><li class=\"navbar-text\"><span class=\"query-total\"><span class=\"label label-default\" id=\"response-summary\"></span> </span>&nbsp;</li><li><a class=\"btn\" data-toggle=\"modal\" data-target=\"#CodeExamples\" data-i18n=\"[title]wdqs-app-button-code-title\"><span class=\"fa fa-code\"></span> <span data-i18n=\"wdqs-app-button-code\"></span></a></li><li><a id=\"download-button\" href=\"#\" data-toggle=\"dropdown\" class=\"dropdown-toggle\" data-placement=\"top\" data-i18n=\"[title]wdqs-app-button-download-title\"><span class=\"glyphicon glyphicon-download-alt\" aria-hidden=\"true\"></span><span data-i18n=\"wdqs-app-button-download\"></span><span class=\"caret\"></span></a><ul class=\"dropdown-menu\" role=\"menu\"><li><a id=\"downloadJSON\" href=\"#\"><span class=\"fa fa-file-code-o\" aria-hidden=\"true\"></span> <span data-i18n=\"wdqs-app-result-json\"></span></a></li><li><a id=\"downloadFull-JSON\" href=\"#\"><span class=\"fa fa-file-code-o\" aria-hidden=\"true\"></span> <span data-i18n=\"wdqs-app-result-json-verbose\"></span></a></li><li role=\"separator\" class=\"divider\"></li><li><a id=\"downloadSimple-TSV\" href=\"#\"><span class=\"fa fa-file-excel-o\" aria-hidden=\"true\"></span> <span data-i18n=\"wdqs-app-result-tsv\"></span></a></li><li><a id=\"downloadTSV\" href=\"#\"><span class=\"fa fa-file-excel-o\" aria-hidden=\"true\"></span> <span data-i18n=\"wdqs-app-result-tsv-verbose\"></span></a></li><li role=\"separator\" class=\"divider\"></li><li><a id=\"downloadCSV\" href=\"#\"><span class=\"fa fa-file-excel-o\" aria-hidden=\"true\"></span> <span data-i18n=\"wdqs-app-result-csv\"></span></a></li><li role=\"separator\" class=\"divider\"></li><li><a id=\"downloadHTML\" href=\"#\"><span class=\"fa fa-file-code-o\" aria-hidden=\"true\"></span> <span data-i18n=\"wdqs-app-result-html\"></span></a></li><li role=\"separator\" class=\"divider\"></li><li><a id=\"downloadSVG\" href=\"#\"><span class=\"fa fa-file-image-o\" aria-hidden=\"true\"></span> <span data-i18n=\"wdqs-app-result-svg\"></span></a></li></ul></li><li><a id=\"link-button\" href=\"#\" data-toggle=\"dropdown\" class=\"dropdown-toggle\" aria-haspopup=\"true\" aria-expanded=\"false\" data-placement=\"top\" data-i18n=\"[title]wdqs-app-button-link-title\"><span class=\"glyphicon glyphicon-link\" aria-hidden=\"true\"></span><span data-i18n=\"wdqs-app-button-link\"></span><span class=\"caret\"></span></a><ul class=\"dropdown-menu\"><li><a href=\"#\" class=\"shortUrlTrigger result\" target=\"_blank\" data-i18n=\"[title]wdqs-app-result-shorturl-title\" data-toggle=\"popover\"><span data-i18n=\"wdqs-app-result-shorturl\"></span></a></li><li><a target=\"_blank\" class=\"queryUri\" data-i18n=\"[title]wdqs-app-result-endpoint-title\"><span data-i18n=\"wdqs-app-result-endpoint\"></span></a></li><li><a href=\"#\" class=\"embed result\" target=\"_blank\" data-toggle=\"popover\" data-i18n=\"wdqs-app-result-embed\"></a></li></ul></li></ul></nav></div><div class=\"row action-bar\"><div class=\"message\"></div></div><div class=\"row\"><div id=\"query-result\">Test result</div></div><div class=\"row\"><div id=\"query-error\" class=\"panel-heading\"></div></div><div class=\"row\"><div id=\"empty-query-error\" class=\"text-center\"><p data-i18n=\"wdqs-action-empty-query\"></p><button type=\"button\" class=\"btn navbar-btn btn-default\" id=\"open-example\" data-toggle=\"modal\" data-target=\"#QueryExamples\"><span class=\"fa fa-folder-open-o\"></span> <span data-i18n=\"wdqs-app-button-examples\" id=\"examples-label\"></span></button></div></div><div class=\"row\"><div id=\"loading-spinner\"><i class=\"fa fa-spinner fa-pulse fa-3x fa-fw\"></i> <span class=\"sr-only\">Loading...</span></div></div><div id=\"explorer-dialogs\"><div class=\"explorer-dialog\"><div data-role=\"header\" class=\"modal-header clearfix explorer-header\"><h3 data-role=\"title\" class=\"modal-title pull-left explorer-title\">Explorer</h3><button data-role=\"close\" type=\"button\" class=\"close\" data-dismiss=\"modal\" aria-label=\"Close\"><span aria-hidden=\"true\">&times;</span></button></div><div data-role=\"body\" class=\"explorer-body\"></div></div></div></div><div class=\"modal fade QueryExamples\" id=\"QueryExamples\" tabindex=\"-1\" role=\"dialog\" aria-labelledby=\"QueryExamplesModalLabel\"><div class=\"modal-dialog modal-lg\" role=\"document\"><div class=\"modal-content\"><div class=\"modal-body\"><div class=\"tagCloud\"></div><div class=\"tagFilter\"></div><div class=\"input-group\"><span class=\"input-group-addon\"><span class=\"glyphicon glyphicon-filter\" aria-hidden=\"true\"></span></span> <input type=\"text\" class=\"tableFilter form-control\" placeholder=\"Type to filter\"> <span class=\"input-group-addon\"><span class=\"badge count\"></span></span></div><div class=\"exampleTable\"><table class=\"table\"><tbody class=\"searchable\"></tbody></table></div></div></div></div></div><div class=\"modal\" id=\"keyboardShortcutHelpModal\" tabindex=\"-1\" role=\"dialog\" aria-labelledby=\"keyboardShortcutHelpModalLabel\" aria-hidden=\"true\"><div class=\"modal-dialog\" role=\"document\"><div class=\"modal-content\"><div class=\"modal-header\"><h5 class=\"modal-title\" id=\"keyboardShortcutHelpModalLabel\" data-i18n=\"wdqs-dialog-key-shortcut-title\"></h5></div><div class=\"modal-body\"><table class=\"keyboard-shortcut-help\"><tbody><tr><th scope=\"row\"><kbd><kbd>ctrl</kbd>+<kbd>enter</kbd></kbd></th><td data-i18n=\"wdqs-dialog-key-shortcut-run-query\"></td></tr><tr><th scope=\"row\"><kbd>esc</kbd></th><td data-i18n=\"wdqs-dialog-key-shortcut-esc\"></td></tr><tr><th scope=\"row\"><kbd>?</kbd></th><td data-i18n=\"wdqs-dialog-key-shortcut-show-shortcut-help\"></td></tr><tr><th scope=\"row\"><kbd>i</kbd></th><td data-i18n=\"wdqs-dialog-key-shortcut-focus-textarea\"></td></tr><tr><th scope=\"row\"><kbd>r</kbd></th><td data-i18n=\"wdqs-dialog-key-shortcut-jump-to-result\"></td></tr><tr><th scope=\"row\"><kbd>f</kbd></th><td data-i18n=\"wdqs-dialog-key-shortcut-focus-filter\"></td></tr><tr><th scope=\"row\"><kbd>s</kbd></th><td data-i18n=\"wdqs-dialog-key-shortcut-focus-show\"></td></tr><tr><th scope=\"row\"><kbd>m</kbd></th><td data-i18n=\"wdqs-dialog-key-shortcut-focus-limit\"></td></tr><tr><th scope=\"row\"><kbd>e</kbd></th><td data-i18n=\"wdqs-dialog-key-shortcut-show-example\"></td></tr><tr><th scope=\"row\"><kbd>h</kbd></th><td data-i18n=\"wdqs-dialog-key-shortcut-help-menu\"></td></tr><tr><th scope=\"row\"><kbd>l</kbd></th><td data-i18n=\"wdqs-dialog-key-shortcut-show-language\"></td></tr></tbody></table></div><div class=\"modal-footer\"><button type=\"button\" class=\"btn btn-default\" data-dismiss=\"modal\" data-i18n=\"wdqs-dialog-key-shortcut-close-button\"></button></div></div></div></div><div class=\"modal fade CodeExamples\" id=\"CodeExamples\" tabindex=\"-1\" role=\"dialog\" aria-labelledby=\"CodeExamplesModalLabel\"><div class=\"modal-dialog modal-lg\" role=\"document\"><div class=\"modal-content\"><div class=\"modal-body\"><div><ul class=\"nav nav-tabs\" role=\"tablist\"></ul><div class=\"tab-content\"></div></div></div></div></div></div><script src=\"js/vendor.min.0c96f018ea3fdcadd317.js\"></script><script src=\"js/wdqs.min.7906af714e7933b9c782.js\"></script></body></html>'\n"
     ]
    }
   ],
   "source": [
    "sparql = SPARQLWrapper(endpoint='https://query.wikidata.org/')\n",
    "sparql.setQuery(\"\"\"\n",
    "PREFIX pq: <http://www.wikidata.org/prop/qualifier/>\n",
    "PREFIX ps: <http://www.wikidata.org/prop/statement/>\n",
    "PREFIX p: <http://www.wikidata.org/prop/>\n",
    "PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "\n",
    "CONSTRUCT {?player p:P54 ?x}\n",
    "WHERE {?player wdt:P106 wd:Q937857}\n",
    "\n",
    "LIMIT 20\n",
    "\n",
    "\"\"\")\n",
    "\n",
    "\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "\n",
    "# the destination file, with code to make it timestamped\n",
    "#destfile = 'rdf_dumps/test-' + datetime.datetime.now().strftime('%Y%m%d-%H%M') + '.rdf'\n",
    "print(results)\n",
    "# serialize the result to file\n",
    "#results.serialize(destination=destfile, format='ttl')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "89965147",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "@prefix schema: <http://schema.org/> .\n",
      "\n",
      "<http://dbpedia.org/resource/Abkhaz_language> a schema:Language ;\n",
      "    schema:alternateName \"ab\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Afar_language> a schema:Language ;\n",
      "    schema:alternateName \"aa\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Afrikaans> a schema:Language ;\n",
      "    schema:alternateName \"af\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Akan_language> a schema:Language ;\n",
      "    schema:alternateName \"ak\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Albanian_language> a schema:Language ;\n",
      "    schema:alternateName \"sq\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Amharic> a schema:Language ;\n",
      "    schema:alternateName \"am\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Arabic> a schema:Language ;\n",
      "    schema:alternateName \"ar\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Aragonese_language> a schema:Language ;\n",
      "    schema:alternateName \"an\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Armenian_language> a schema:Language ;\n",
      "    schema:alternateName \"hy\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Assamese_language> a schema:Language ;\n",
      "    schema:alternateName \"as\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Avar_language> a schema:Language ;\n",
      "    schema:alternateName \"av\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Avestan> a schema:Language ;\n",
      "    schema:alternateName \"ae\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Aymara_language> a schema:Language ;\n",
      "    schema:alternateName \"ay\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Azerbaijani_language> a schema:Language ;\n",
      "    schema:alternateName \"az\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Bambara_language> a schema:Language ;\n",
      "    schema:alternateName \"bm\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Bashkir_language> a schema:Language ;\n",
      "    schema:alternateName \"ba\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Basque_language> a schema:Language ;\n",
      "    schema:alternateName \"eu\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Belarusian_language> a schema:Language ;\n",
      "    schema:alternateName \"be\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Bengali_language__Bengali__1> a schema:Language ;\n",
      "    schema:alternateName \"bn\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Bislama> a schema:Language ;\n",
      "    schema:alternateName \"bi\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Bokmål> a schema:Language ;\n",
      "    schema:alternateName \"nb\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Bolivian_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Bosnian_language> a schema:Language ;\n",
      "    schema:alternateName \"bs\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Breton_language> a schema:Language ;\n",
      "    schema:alternateName \"br\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Bulgarian_language__Bulgarian__1> a schema:Language ;\n",
      "    schema:alternateName \"bg\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Burmese_language__Burmese__1> a schema:Language ;\n",
      "    schema:alternateName \"my\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Cameroonian_English> a schema:Language ;\n",
      "    schema:alternateName \"en\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Campidanese_Sardinian> a schema:Language ;\n",
      "    schema:alternateName \"sc\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Catalan_language> a schema:Language ;\n",
      "    schema:alternateName \"ca\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Central_American_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Chamorro_language> a schema:Language ;\n",
      "    schema:alternateName \"ch\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Chechen_language> a schema:Language ;\n",
      "    schema:alternateName \"ce\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Chewa_language> a schema:Language ;\n",
      "    schema:alternateName \"ny\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Chinese_language> a schema:Language ;\n",
      "    schema:alternateName \"zh\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Church_Slavonic> a schema:Language ;\n",
      "    schema:alternateName \"cu\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Chuvash_language__Chuvash__1> a schema:Language ;\n",
      "    schema:alternateName \"cv\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Colombian_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Contemporary_Latin> a schema:Language ;\n",
      "    schema:alternateName \"la\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Cornish_language> a schema:Language ;\n",
      "    schema:alternateName \"kw\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Corsican_language> a schema:Language ;\n",
      "    schema:alternateName \"co\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Costa_Rican_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Cree_language__Cree__1> a schema:Language ;\n",
      "    schema:alternateName \"cr\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Croatian_language> a schema:Language ;\n",
      "    schema:alternateName \"hr\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Czech_language> a schema:Language ;\n",
      "    schema:alternateName \"cs\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Dalian_dialect> a schema:Language ;\n",
      "    schema:alternateName \"zh\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Danish_language> a schema:Language ;\n",
      "    schema:alternateName \"da\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Dominican_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Dutch_language> a schema:Language ;\n",
      "    schema:alternateName \"nl\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Dzongkha> a schema:Language ;\n",
      "    schema:alternateName \"dz\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Ecuadorian_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/English_language> a schema:Language ;\n",
      "    schema:alternateName \"en\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Esperanto> a schema:Language ;\n",
      "    schema:alternateName \"eo\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Estonian_language> a schema:Language ;\n",
      "    schema:alternateName \"et\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Ewe_language> a schema:Language ;\n",
      "    schema:alternateName \"ee\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Faroese_language> a schema:Language ;\n",
      "    schema:alternateName \"fo\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Fijian_language> a schema:Language ;\n",
      "    schema:alternateName \"fj\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Finnish_language> a schema:Language ;\n",
      "    schema:alternateName \"fi\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Flemish> a schema:Language ;\n",
      "    schema:alternateName \"nl\" .\n",
      "\n",
      "<http://dbpedia.org/resource/French_language> a schema:Language ;\n",
      "    schema:alternateName \"fr\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Fula_language> a schema:Language ;\n",
      "    schema:alternateName \"ff\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Galician_language> a schema:Language ;\n",
      "    schema:alternateName \"gl\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Gascon_dialect> a schema:Language ;\n",
      "    schema:alternateName \"oc\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Georgian_language> a schema:Language ;\n",
      "    schema:alternateName \"ka\" .\n",
      "\n",
      "<http://dbpedia.org/resource/German_language__German__1> a schema:Language ;\n",
      "    schema:alternateName \"de\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Greek_language> a schema:Language ;\n",
      "    schema:alternateName \"el\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Greenlandic_language> a schema:Language ;\n",
      "    schema:alternateName \"kl\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Guarani_language__Guaraní__1> a schema:Language ;\n",
      "    schema:alternateName \"gn\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Guatemalan_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Gujarati_language__Gujarati__1> a schema:Language ;\n",
      "    schema:alternateName \"gu\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Haitian_Creole__Haitian_Creole__1> a schema:Language ;\n",
      "    schema:alternateName \"ht\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Hausa_language> a schema:Language ;\n",
      "    schema:alternateName \"ha\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Hebrew_language> a schema:Language ;\n",
      "    schema:alternateName \"he\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Herero_language__Herero__1> a schema:Language ;\n",
      "    schema:alternateName \"hz\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Hindi> a schema:Language ;\n",
      "    schema:alternateName \"hi\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Hindustani_language> a schema:Language ;\n",
      "    schema:alternateName \"hi\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Hiri_Motu> a schema:Language ;\n",
      "    schema:alternateName \"ho\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Honduran_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Hungarian_language> a schema:Language ;\n",
      "    schema:alternateName \"hu\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Høgnorsk> a schema:Language ;\n",
      "    schema:alternateName \"no\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Icelandic_language> a schema:Language ;\n",
      "    schema:alternateName \"is\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Ido> a schema:Language ;\n",
      "    schema:alternateName \"io\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Igbo_language> a schema:Language ;\n",
      "    schema:alternateName \"ig\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Indian_English__Indian_English__1> a schema:Language ;\n",
      "    schema:alternateName \"en\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Indonesian_language> a schema:Language ;\n",
      "    schema:alternateName \"id\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Interlingua> a schema:Language ;\n",
      "    schema:alternateName \"ia\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Interlingue> a schema:Language ;\n",
      "    schema:alternateName \"ie\" .\n",
      "\n",
      "<http://dbpedia.org/resource/International_English> a schema:Language ;\n",
      "    schema:alternateName \"en\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Inuinnaqtun> a schema:Language ;\n",
      "    schema:alternateName \"iu\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Inuktitut> a schema:Language ;\n",
      "    schema:alternateName \"iu\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Inuvialuktun> a schema:Language ;\n",
      "    schema:alternateName \"iu\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Irish_language> a schema:Language ;\n",
      "    schema:alternateName \"ga\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Italian_language> a schema:Language ;\n",
      "    schema:alternateName \"it\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Iñupiaq_language> a schema:Language ;\n",
      "    schema:alternateName \"ik\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Japanese_language__Japanese__1> a schema:Language ;\n",
      "    schema:alternateName \"ja\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Javanese_language__Javanese__1> a schema:Language ;\n",
      "    schema:alternateName \"jv\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Kannada> a schema:Language ;\n",
      "    schema:alternateName \"kn\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Kanuri_language> a schema:Language ;\n",
      "    schema:alternateName \"kr\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Kashmiri_language> a schema:Language ;\n",
      "    schema:alternateName \"ks\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Kazakh_language> a schema:Language ;\n",
      "    schema:alternateName \"kk\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Khmer_language> a schema:Language ;\n",
      "    schema:alternateName \"km\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Kikuyu_language> a schema:Language ;\n",
      "    schema:alternateName \"ki\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Kinyarwanda> a schema:Language ;\n",
      "    schema:alternateName \"rw\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Kirundi> a schema:Language ;\n",
      "    schema:alternateName \"rn\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Komi_language> a schema:Language ;\n",
      "    schema:alternateName \"kv\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Kongo_language> a schema:Language ;\n",
      "    schema:alternateName \"kg\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Korean_dialects> a schema:Language ;\n",
      "    schema:alternateName \"ko\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Korean_language> a schema:Language ;\n",
      "    schema:alternateName \"ko\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Kurdish_languages> a schema:Language ;\n",
      "    schema:alternateName \"ku\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Kurmanji> a schema:Language ;\n",
      "    schema:alternateName \"ku\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Kwanyama_dialect> a schema:Language ;\n",
      "    schema:alternateName \"kj\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Kyrgyz_language__Kyrgyz__1> a schema:Language ;\n",
      "    schema:alternateName \"ky\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Latin> a schema:Language ;\n",
      "    schema:alternateName \"la\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Latvian_language> a schema:Language ;\n",
      "    schema:alternateName \"lv\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Lhasa_Tibetan> a schema:Language ;\n",
      "    schema:alternateName \"bo\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Limburgish> a schema:Language ;\n",
      "    schema:alternateName \"li\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Lingala> a schema:Language ;\n",
      "    schema:alternateName \"ln\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Lithuanian_language> a schema:Language ;\n",
      "    schema:alternateName \"lt\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Logudorese_Sardinian> a schema:Language ;\n",
      "    schema:alternateName \"sc\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Luba-Katanga_language> a schema:Language ;\n",
      "    schema:alternateName \"lu\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Luganda> a schema:Language ;\n",
      "    schema:alternateName \"lg\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Luxembourgish> a schema:Language ;\n",
      "    schema:alternateName \"lb\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Macedonian_language> a schema:Language ;\n",
      "    schema:alternateName \"mk\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Malagasy_language> a schema:Language ;\n",
      "    schema:alternateName \"mg\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Malay_language__Malay__1> a schema:Language ;\n",
      "    schema:alternateName \"ms\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Malayalam> a schema:Language ;\n",
      "    schema:alternateName \"ml\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Maldivian_language> a schema:Language ;\n",
      "    schema:alternateName \"dv\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Maltese_language> a schema:Language ;\n",
      "    schema:alternateName \"mt\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Marathi_language> a schema:Language ;\n",
      "    schema:alternateName \"mr\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Marshallese_language> a schema:Language ;\n",
      "    schema:alternateName \"mh\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Mexican_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Modern_English__Modern_English__1> a schema:Language ;\n",
      "    schema:alternateName \"en\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Modern_Greek> a schema:Language ;\n",
      "    schema:alternateName \"el\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Modern_Hebrew> a schema:Language ;\n",
      "    schema:alternateName \"he\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Modern_Norwegian> a schema:Language ;\n",
      "    schema:alternateName \"no\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Moldovan_language> a schema:Language ;\n",
      "    schema:alternateName \"ro\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Mongolian_language__Mongolian__1> a schema:Language ;\n",
      "    schema:alternateName \"mn\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Māori_language> a schema:Language ;\n",
      "    schema:alternateName \"mi\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Nauruan_language> a schema:Language ;\n",
      "    schema:alternateName \"na\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Navajo_language> a schema:Language ;\n",
      "    schema:alternateName \"nv\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Ndonga_dialect> a schema:Language ;\n",
      "    schema:alternateName \"ng\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Nepali_language__Nepali__1> a schema:Language ;\n",
      "    schema:alternateName \"ne\" .\n",
      "\n",
      "<http://dbpedia.org/resource/New_High_German> a schema:Language ;\n",
      "    schema:alternateName \"de\" .\n",
      "\n",
      "<http://dbpedia.org/resource/New_Latin> a schema:Language ;\n",
      "    schema:alternateName \"la\" .\n",
      "\n",
      "<http://dbpedia.org/resource/New_Persian> a schema:Language ;\n",
      "    schema:alternateName \"fa\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Nicaraguan_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Northern_Ndebele_language> a schema:Language ;\n",
      "    schema:alternateName \"nd\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Northern_Sami> a schema:Language ;\n",
      "    schema:alternateName \"se\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Norwegian_language> a schema:Language ;\n",
      "    schema:alternateName \"no\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Nuosu_language> a schema:Language ;\n",
      "    schema:alternateName \"ii\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Nynorsk> a schema:Language ;\n",
      "    schema:alternateName \"nn\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Occitan_language__Occitan__1> a schema:Language ;\n",
      "    schema:alternateName \"oc\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Odia_language> a schema:Language ;\n",
      "    schema:alternateName \"or\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Ojibwe_language> a schema:Language ;\n",
      "    schema:alternateName \"oj\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Old_Church_Slavonic> a schema:Language ;\n",
      "    schema:alternateName \"cu\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Oromo_language> a schema:Language ;\n",
      "    schema:alternateName \"om\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Ossetian_language__Ossetian__1> a schema:Language ;\n",
      "    schema:alternateName \"os\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Pakistani_English__Pakistani_English__1> a schema:Language ;\n",
      "    schema:alternateName \"en\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Pali> a schema:Language ;\n",
      "    schema:alternateName \"pi\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Panamanian_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Paraguayan_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Persian_language> a schema:Language ;\n",
      "    schema:alternateName \"fa\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Peruvian_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Polish_language> a schema:Language ;\n",
      "    schema:alternateName \"pl\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Portuguese_language> a schema:Language ;\n",
      "    schema:alternateName \"pt\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Punjabi_language> a schema:Language ;\n",
      "    schema:alternateName \"pa\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Riksmål> a schema:Language ;\n",
      "    schema:alternateName \"no\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Rioplatense_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Romanian_language__Romanian__1> a schema:Language ;\n",
      "    schema:alternateName \"ro\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Russian_language__Russian__1> a schema:Language ;\n",
      "    schema:alternateName \"ru\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Salvadoran_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Samoan_language> a schema:Language ;\n",
      "    schema:alternateName \"sm\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Sango_language> a schema:Language ;\n",
      "    schema:alternateName \"sg\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Sanskrit> a schema:Language ;\n",
      "    schema:alternateName \"sa\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Sardinian_language> a schema:Language ;\n",
      "    schema:alternateName \"sc\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Scottish_Gaelic> a schema:Language ;\n",
      "    schema:alternateName \"gd\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Serbian_language__Serbian__1> a schema:Language ;\n",
      "    schema:alternateName \"sr\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Serbo-Croatian> a schema:Language ;\n",
      "    schema:alternateName \"sh\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Shona_language> a schema:Language ;\n",
      "    schema:alternateName \"sn\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Shtokavian> a schema:Language ;\n",
      "    schema:alternateName \"sh\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Sindhi_language__Sindhi__1> a schema:Language ;\n",
      "    schema:alternateName \"sd\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Sinhala_language> a schema:Language ;\n",
      "    schema:alternateName \"si\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Slovak_language__Slovak__1> a schema:Language ;\n",
      "    schema:alternateName \"sk\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Slovene_language> a schema:Language ;\n",
      "    schema:alternateName \"sl\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Somali_language__Somali__1> a schema:Language ;\n",
      "    schema:alternateName \"so\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Sotho_language> a schema:Language ;\n",
      "    schema:alternateName \"st\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Southern_Ndebele_language> a schema:Language ;\n",
      "    schema:alternateName \"nr\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Spanish_language> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Spanish_language_in_the_United_States> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Standard_German> a schema:Language ;\n",
      "    schema:alternateName \"de\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Standard_Persian> a schema:Language ;\n",
      "    schema:alternateName \"fa\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Standard_Zhuang> a schema:Language ;\n",
      "    schema:alternateName \"za\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Sundanese_language__Sundanese__1> a schema:Language ;\n",
      "    schema:alternateName \"su\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Swahili_language> a schema:Language ;\n",
      "    schema:alternateName \"sw\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Swazi_language> a schema:Language ;\n",
      "    schema:alternateName \"ss\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Swedish_language> a schema:Language ;\n",
      "    schema:alternateName \"sv\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Tagalog_language__Tagalog__1> a schema:Language ;\n",
      "    schema:alternateName \"tl\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Tahitian_language> a schema:Language ;\n",
      "    schema:alternateName \"ty\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Tajik_language> a schema:Language ;\n",
      "    schema:alternateName \"tg\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Tamil_language> a schema:Language ;\n",
      "    schema:alternateName \"ta\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Tatar_language> a schema:Language ;\n",
      "    schema:alternateName \"tt\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Telugu_language> a schema:Language ;\n",
      "    schema:alternateName \"te\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Thai_language__Thai__1> a schema:Language ;\n",
      "    schema:alternateName \"th\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Tigrinya_language> a schema:Language ;\n",
      "    schema:alternateName \"ti\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Tongan_language> a schema:Language ;\n",
      "    schema:alternateName \"to\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Tsonga_language> a schema:Language ;\n",
      "    schema:alternateName \"ts\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Tswana_language> a schema:Language ;\n",
      "    schema:alternateName \"tn\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Turkish_language> a schema:Language ;\n",
      "    schema:alternateName \"tr\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Turkmen_language__Turkmen__1> a schema:Language ;\n",
      "    schema:alternateName \"tk\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Twi> a schema:Language ;\n",
      "    schema:alternateName \"tw\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Ukrainian_language> a schema:Language ;\n",
      "    schema:alternateName \"uk\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Urdu> a schema:Language ;\n",
      "    schema:alternateName \"ur\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Uruguayan_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Uyghur_language__Uyghur__1> a schema:Language ;\n",
      "    schema:alternateName \"ug\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Uzbek_language> a schema:Language ;\n",
      "    schema:alternateName \"uz\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Venda_language> a schema:Language ;\n",
      "    schema:alternateName \"ve\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Venezuelan_Spanish> a schema:Language ;\n",
      "    schema:alternateName \"es\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Vietnamese_language> a schema:Language ;\n",
      "    schema:alternateName \"vi\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Volapük> a schema:Language ;\n",
      "    schema:alternateName \"vo\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Walloon_language> a schema:Language ;\n",
      "    schema:alternateName \"wa\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Welsh_language__Welsh__1> a schema:Language ;\n",
      "    schema:alternateName \"cy\" .\n",
      "\n",
      "<http://dbpedia.org/resource/West_Bengali_dialect> a schema:Language ;\n",
      "    schema:alternateName \"bn\" .\n",
      "\n",
      "<http://dbpedia.org/resource/West_Frisian_language__West_Frisian__1> a schema:Language ;\n",
      "    schema:alternateName \"fy\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Wolof_language> a schema:Language ;\n",
      "    schema:alternateName \"wo\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Xhosa_language> a schema:Language ;\n",
      "    schema:alternateName \"xh\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Yiddish> a schema:Language ;\n",
      "    schema:alternateName \"yi\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Yoruba_language> a schema:Language ;\n",
      "    schema:alternateName \"yo\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Zhuang_languages> a schema:Language ;\n",
      "    schema:alternateName \"za\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Zigong_dialect> a schema:Language ;\n",
      "    schema:alternateName \"zh\" .\n",
      "\n",
      "<http://dbpedia.org/resource/Zulu_language> a schema:Language ;\n",
      "    schema:alternateName \"zu\" .\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, XML\n",
    "from rdflib import Graph\n",
    "\n",
    "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")\n",
    "sparql.setQuery(\"\"\"\n",
    "    PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "    PREFIX schema: <http://schema.org/>\n",
    "    CONSTRUCT {\n",
    "      ?lang a schema:Language ;\n",
    "      schema:alternateName ?iso6391Code . \n",
    "    }\n",
    "    WHERE {\n",
    "      ?lang a dbo:Language ;\n",
    "      dbo:iso6391Code ?iso6391Code .\n",
    "      FILTER (STRLEN(?iso6391Code)=2) # to filter out non-valid values\n",
    "    }\n",
    "\"\"\")\n",
    "\n",
    "\n",
    "results = sparql.query().convert()\n",
    "print(results.serialize())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "f8da6882",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Player   played_for Team\n",
      "http://www.wikidata.org/entity/Q10723     http://www.wikidata.org/prop/P54     http://www.wikidata.org/entity/Q2714\n"
     ]
    }
   ],
   "source": [
    "# Gives you player played_for team details\n",
    "sparql = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "sparql.setReturnFormat(JSON)\n",
    "\n",
    "played_for_query = \"\"\"\n",
    "\n",
    "\n",
    "PREFIX pq: <http://www.wikidata.org/prop/qualifier/>\n",
    "PREFIX ps: <http://www.wikidata.org/prop/statement/>\n",
    "PREFIX p: <http://www.wikidata.org/prop/>\n",
    "PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "\n",
    "SELECT ?player ?relation ?team\n",
    "WHERE {\n",
    "   ?player wdt:P106 wd:Q937857.\n",
    "\n",
    "   ?player p:P54 ?position_held_statement .\n",
    "   ?position_held_statement ps:P54 ?team .\n",
    "  VALUES ?relation {p:P54}.\n",
    "  }\n",
    "limit 20\n",
    "\"\"\"\n",
    "\n",
    "sparql.setQuery(played_for_query)\n",
    "\n",
    "\n",
    "played_for_results = sparql.query().convert()\n",
    "\n",
    "for result in played_for_results[\"results\"][\"bindings\"]:\n",
    "    #pass\n",
    "    print(\"Player\",\" \",\"played_for\", \"Team\")\n",
    "    print(result[\"player\"][\"value\"], \"   \", result[\"relation\"][\"value\"], \"   \",result[\"team\"][\"value\"])\n",
    "    break;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "c7aacf69",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Player   played_for Start end\n",
      "http://www.wikidata.org/entity/Q19365     http://www.wikidata.org/entity/Q10333     2008-01-01T00:00:00Z   2014-01-01T00:00:00Z\n"
     ]
    }
   ],
   "source": [
    "#pull temporal data for player and when he played for a team\n",
    "\n",
    "played_for_time_query =\"\"\"\n",
    "\n",
    "SELECT ?player ?team ?start ?end\n",
    "WHERE {\n",
    "   ?player wdt:P106 wd:Q937857.\n",
    "\n",
    "   ?player p:P54 ?position_held_statement .\n",
    "   ?position_held_statement ps:P54 ?team .\n",
    "   ?position_held_statement pq:P580 ?start .\n",
    "  ?position_held_statement pq:P582 ?end .\n",
    "  \n",
    " } \n",
    "limit 20\n",
    "\n",
    "\"\"\"\n",
    "sparql.setQuery(played_for_time_query)\n",
    "\n",
    "\n",
    "played_for_time_results = sparql.query().convert()\n",
    "\n",
    "for result in played_for_time_results[\"results\"][\"bindings\"]:\n",
    "    #pass\n",
    "    print(\"Player\",\" \",\"played_for\", \"Start\",\"end\")\n",
    "    print(result[\"player\"][\"value\"], \"   \", result[\"team\"][\"value\"], \"   \",result[\"start\"][\"value\"],\" \",result[\"end\"][\"value\"])\n",
    "    break;\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "82a883c6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Team   played_for Team\n",
      "http://www.wikidata.org/entity/Q54834034     http://www.wikidata.org/prop/P17     http://www.wikidata.org/entity/Q159\n"
     ]
    }
   ],
   "source": [
    "# gives you team and its country \n",
    "#Note: some teams have multiple country values based on time\n",
    "\n",
    "teams_country_query = \"\"\"\n",
    "\n",
    "SELECT ?team ?relation ?country\n",
    "WHERE {\n",
    "   ?player wdt:P106 wd:Q937857.\n",
    "\n",
    "   ?player p:P54 ?team_played_statement .\n",
    "   ?team_played_statement ps:P54 ?team .\n",
    "   ?team p:P17 ?country_statement.\n",
    "   ?country_statement ps:P17 ?country.\n",
    "  VALUES ?relation {p:P17}.\n",
    "  }\n",
    "limit 20\n",
    "\"\"\"\n",
    "sparql.setQuery(teams_country_query)\n",
    "\n",
    "teams_country_results = sparql.query().convert()\n",
    "\n",
    "for result in teams_country_results[\"results\"][\"bindings\"]:\n",
    "    #pass\n",
    "    print(\"Team\",\" \",\"played_for\", \"Team\")\n",
    "    print(result[\"team\"][\"value\"], \"   \", result[\"relation\"][\"value\"], \"   \",result[\"country\"][\"value\"])\n",
    "    break;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "6786ba54",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Pull temporal data for team and its country here\n",
    "\n",
    "teams_country_time_query =\"\"\"\n",
    "\n",
    "SELECT ?team ?country \n",
    "WHERE {\n",
    "   ?player wdt:P106 wd:Q937857.\n",
    "\n",
    "   ?player p:P54 ?team_played_statement .\n",
    "   ?team_played_statement ps:P54 ?team .\n",
    "   ?team p:P17 ?country_statement.\n",
    "   ?country_statement ps:P17 ?country.\n",
    "  VALUES ?relation {p:P17}.\n",
    "  }\n",
    "limit 20\n",
    "\n",
    "\"\"\"\n",
    "sparql.setQuery(played_for_time_query)\n",
    "\n",
    "\n",
    "played_for_time_results = sparql.query().convert()\n",
    "\n",
    "for result in played_for_time_results[\"results\"][\"bindings\"]:\n",
    "    #pass\n",
    "    print(\"Player\",\" \",\"played_for\", \"Start\",\"end\")\n",
    "    print(result[\"player\"][\"value\"], \"   \", result[\"team\"][\"value\"], \"   \",result[\"start\"][\"value\"],\" \",result[\"end\"][\"value\"])\n",
    "    break;\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "93459046",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Team   is in League\n",
      "http://www.wikidata.org/entity/Q19481     http://www.wikidata.org/prop/P118     http://www.wikidata.org/entity/Q9448\n"
     ]
    }
   ],
   "source": [
    "# gives you team and the league\n",
    "#Note: some teams have multiple country values based on time\n",
    "\n",
    "teams_league_query = \"\"\"\n",
    "\n",
    "SELECT ?team ?relation ?league\n",
    "WHERE {\n",
    "   ?player wdt:P106 wd:Q937857. # player belonging to football association\n",
    "\n",
    "   ?player p:P54 ?team_played_statement .\n",
    "   ?team_played_statement ps:P54 ?team .\n",
    "   ?team p:P118 ?league_statement.\n",
    "   ?league_statement ps:P118 ?league.\n",
    "  VALUES ?relation {p:P118}.\n",
    "  }\n",
    "limit 20\n",
    "\"\"\"\n",
    "sparql.setQuery(teams_league_query)\n",
    "\n",
    "teams_league_results = sparql.query().convert()\n",
    "\n",
    "for result in teams_league_results[\"results\"][\"bindings\"]:\n",
    "    #pass\n",
    "    print(\"Team\",\" \",\"is in\", \"League\")\n",
    "    print(result[\"team\"][\"value\"], \"   \", result[\"relation\"][\"value\"], \"   \",result[\"league\"][\"value\"])\n",
    "    break;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f2307bc5",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
